{
  "headline": "Computer Science, Economics, and Data Science",
  "about": "Hi! I'm a senior at Vanderbilt University, studying computer science, economics, and data science. I'm also a tennis player, a digital artist, and a snowboarder.",
  "email": "jovian.l.wang@vanderbilt.edu",
  "socials": [
    {
      "icon": "fas fa-envelope",
      "link": "mailto:jovian.l.wang@vanderbilt.edu?subject=Lets connect!"
    },
    {
      "icon": "fab fa-linkedin-in",
      "link": "https://www.linkedin.com/in/jovianwang/"
    },
    { "icon": "fa-brands fa-github", "link": "https://github.com/jovianw" }
  ],
  "cards": [
    {
      "image": "accenture.jpg",
      "title": "Operations Studio Tech Associate, Accenture",
      "year": "2023",
      "description": "Orchestrated the complete lifecycle of an internal website project showcasing Operations Studio services and tech products to increase client acquisition and interaction. Produced interactive illustrations for proposals, increasing engagement and ultimately securing a novel business partnership and a government joint project."
    },
    {
      "image": "icb_scraper.png",
      "title": "Research Assistant, Ivy College of Business",
      "year": "2023",
      "description": "Developed a comprehensive Python package from the ground up for efficient web scraping of marketing-related datapoints from 20 prominent news websites, enabling advanced analyses of digital media trends."
    },
    {
      "image": "scuffedfish.png",
      "title": "ScuffedFish: A Minimax & Alpha-Beta Pruning Chess AI",
      "year": "2022",
      "description": "Developed and analyzed a custom client-side JavaScript chess engine using minimax and alpha-beta pruning. Assessed the performance of different utility functions. Determined that the addition of positional utility increases win rate as well as the occurrence of common chess openings.",
      "link": { "text": "ScuffedFish", "url": "https://jovian.wang/chessbot/" }
    },
    {
      "image": "networks.png",
      "title": "Explaining Species Endangerment Through Network Analysis",
      "year": "2022",
      "description": "Using the IUCN RedList API and Greater Antillean coral reef guild-prey and guild-species datasets, examined the correlations between species endangerment levels and various network metrics. Case study uses network analysis to highlight the greater endangerment level of species with high node distance from producer species."
    },
    {
      "image": "snowboard.png",
      "title": "Snowboard Microsite",
      "year": "2022",
      "description": "A WIP personal project. Created a Useless Web-esque micro-website to play as a snowboarder. Curious, useless, un-optimized, and satisfying.",
      "link": {
        "text": "Snowboard",
        "url": "https://jovian.wang/old_website_v2/snowboard.html"
      }
    },
    {
      "image": "vandyhacks.jpg",
      "title": "VandyHacks Design Board",
      "year": "2022",
      "description": "Led the design of Vanderbilt University’s ninth annual hackathon website, designed VandyHack’s cross-year mobile website, and coordinated on-site environmental installations. Collaborated with the marketing board and other student groups to attracted hundreds more participants to VandyHacks IX than the hackathon of the previous year.",
      "link": { "text": "VandyHacks", "url": "https://vandyhacks.org/" }
    },
    {
      "image": "amador.jpg",
      "title": "Software Engineer Intern, Amador Bioscience",
      "year": "2022",
      "description": "Led a three-intern team for the full stack development of an analysis tool using R Shiny and C++. Improved company efficiency by automating the production of NCA tables, listings, and figures. Implemented a web interface to enable analysis customization via a simple user workflow. Established unit tests and documentation structures for future development."
    },
    {
      "image": "bird.jpg",
      "title": "Bird Microsite",
      "year": "2022",
      "description": "A neat little personal project. Experimented with JavaScript to create a fun little website.",
      "link": { "text": "Bird", "url": "https://jovian.wang/bird/" }
    },
    {
      "image": "vanderbilt.jpg",
      "title": "Digital Systems Teaching Assistant, Vanderbilt University",
      "year": "2021-2022",
      "description": "Tutored 33 students in logic, organization, and assembly language programming. Facilitated the transition to an online question-and-answer platform for students to anonymously seek coursework help. Assisted professor in grading homework and exams. Standardized scoring and refined answer keys for future use."
    },
    {
      "image": "websiteV2.jpg",
      "title": "Jovian.Wang V2",
      "year": "2021",
      "description": "Rebuilt this website from the ground up, picking up skills html, css, and javascript.",
      "link": {
        "text": "Jovian.Wang V2",
        "url": "https://jovian.wang/old_website_v2/resume.html"
      }
    },
    {
      "image": "amador.jpg",
      "title": "Machine Learning Research Intern, Amador Bioscience",
      "year": "2021",
      "description": "Used R and XGBoost to construct various machine learning models of drug efficacy from subject data and determine subject feature importance. Reported results to company executives. Guided future research objectives by identifying key features that impact drug efficacy."
    },
    {
      "image": "websiteV1.jpg",
      "title": "Jovian.Wang V1",
      "year": "2021",
      "description": "Built and deployed the first version of this website using Jekyll themes and GitHub Pages.",
      "link": {
        "text": "Jovian.Wang V1",
        "url": "https://jovian.wang/old_website/"
      }
    },
    {
      "image": "robotics.png",
      "title": "Vanderbilt Robotics Camera Sub-Team",
      "year": "2021",
      "description": "Worked with Camera Sub-team to implement robot vision and compete in the NASA Lunabotics Competition."
    },
    {
      "image": "vanderbilt.jpg",
      "title": "Vanderbilt University",
      "year": "2020-2024",
      "description": "Bachelor of Science in Computer Science, Bachelor of Arts in Economics.<br/>Minor in Data Science.<br/>GPA: 3.867/4.000"
    },
    {
      "image": "yygs.jpg",
      "title": "An Insight into China’s Investments in Kenya, Yale Young Global Scholars",
      "year": "2019",
      "description": "Conducted and presented a case study of China-Kenya relations and the influence of foreign aid on state sovereignty. Highlighted the expanding economic influence of China upon third-world countries and its cultural, political, and long-term impact."
    },
    {
      "image": "carleton.png",
      "title": "What’s Your Beef: The Effect of Visual Representation on Framing, SQRI",
      "year": "2018",
      "description": "Conducted during the Carleton College Summer Quantitative Reasoning Institute. Led a student behavioral economics team to analyze psychological framing from product packaging. Conducted an Amazon MTurk experiment on consumer ratings and a 2-by-3 analysis of variance on the data.",
      "link": { "text": "What's Your Beef", "url": "/CarletonSQRI.pdf" }
    }
  ]
}
